{
  "experience": [
    {
      "jobTitle": "Java Full Stack Developer Intern",
      "company": "ABC Technologies",
      "duration": "Jan 2024 - Present",
      "location": "Nashik, India",
      "summary": "Working as a Java Full Stack Developer intern, focusing on developing and maintaining web applications using Spring Boot, Hibernate, and Angular. Collaborated with senior developers to design efficient back-end services and improve front-end performance.",
      "keyResponsibilities": [
        "Developed RESTful APIs using Spring Boot for back-end services",
        "Integrated Angular for responsive front-end development",
        "Implemented security features using Spring Security",
        "Worked with MySQL databases to manage and query data",
        "Collaborated with the team on project deployment and bug fixes"
      ]
    },
    {
      "jobTitle": "Web Development Intern",
      "company": "XYZ Solutions",
      "duration": "Jun 2023 - Dec 2023",
      "location": "Remote",
      "summary": "Worked on various web development projects, building front-end components using HTML, CSS, and JavaScript. Assisted in developing MERN stack applications for clients and gained exposure to Node.js, React, and MongoDB.",
      "keyResponsibilities": [
        "Built responsive and interactive user interfaces using React.js",
        "Integrated back-end APIs with front-end applications",
        "Developed role-based authentication and authorization using JWT",
        "Collaborated with cross-functional teams for requirement analysis",
        "Worked on payment integration using Stripe and order management"
      ]
    },
    {
      "jobTitle": "Technical Trainee",
      "company": "TNS India Foundation",
      "duration": "Aug 2022 - Dec 2022",
      "location": "Pune, India",
      "summary": "Completed a technical training program focusing on Java, Hibernate, Spring Boot, and web development. Gained practical experience in developing full-stack applications and working with databases.",
      "keyResponsibilities": [
        "Learned and implemented Java and Hibernate in project environments",
        "Worked on basic Spring Boot applications for data management",
        "Collaborated with peers on team-based coding projects",
        "Attended workshops on best practices in software development"
      ]
    }
  ]
}
